'use strict';

var customCitiesData = [
  {
    c: '330000',
    n: '浙江省',
    s: [{
      c: '330100',
      n: '杭州市',
      s: [{c: '330102', n: '上城区'}, {c: '330103', n: '下城区'}, {c: '330104', n: '江干区'}, {
        c: '330105',
        n: '拱墅区'
      }, {c: '330106', n: '西湖区'}, {c: '330108', n: '滨江区'}, {c: '330109', n: '萧山区'}, { c: '330110',
        n: '余杭区'
      }, {c: '330183',
        n: '富阳区'
      }, {c: '330122', n: '桐庐县'}, {c: '330127', n: '淳安县'}, {c: '330182', n: '建德市'}, {c: '330185', n: '临安市'}]
    }, {
      c: '330200',
      n: '宁波市',
      s: [{c: '330203', n: '海曙区'}, {c: '330204', n: '江东区'}, {c: '330205', n: '江北区'}, {
        c: '330206',
        n: '北仑区'
      }, {c: '330211', n: '镇海区'}, {c: '330212', n: '鄞州区'}, {c: '330225', n: '象山县'}, {
        c: '330226',
        n: '宁海县'
      }, {c: '330281', n: '余姚市'}, {c: '330282', n: '慈溪市'}, {c: '330283', n: '奉化市'}]
    }, {
      c: '330300',
      n: '温州市',
      s: [{c: '330302', n: '鹿城区'}, {c: '330303', n: '龙湾区'}, {c: '330304', n: '瓯海区'}, {
        c: '330322',
        n: '洞头县'
      }, {c: '330324', n: '永嘉县'}, {c: '330326', n: '平阳县'}, {c: '330327', n: '苍南县'}, {
        c: '330328',
        n: '文成县'
      }, {c: '330329', n: '泰顺县'}, {c: '330381', n: '瑞安市'}, {c: '330382', n: '乐清市'}]
    }, {
      c: '330400',
      n: '嘉兴市',
      s: [{c: '330402', n: '南湖区'}, {c: '330411', n: '秀洲区'}, {c: '330421', n: '嘉善县'}, {
        c: '330424',
        n: '海盐县'
      }, {c: '330481', n: '海宁市'}, {c: '330482', n: '平湖市'}, {c: '330483', n: '桐乡市'}]
    }, {
      c: '330500',
      n: '湖州市',
      s: [{c: '330502', n: '吴兴区'}, {c: '330503', n: '南浔区'}, {c: '330521', n: '德清县'}, {
        c: '330522',
        n: '长兴县'
      }, {c: '330523', n: '安吉县'}]
    }, {
      c: '330600',
      n: '绍兴市',
      s: [{c: '330602', n: '越城区'}, {c: '330603', n: '柯桥区'}, {c: '330604', n: '上虞区'}, {
        c: '330624',
        n: '新昌县'
      }, {c: '330681', n: '诸暨市'}, {c: '330683', n: '嵊州市'}]
    }, {
      c: '330700',
      n: '金华市',
      s: [{c: '330702', n: '婺城区'}, {c: '330703', n: '金东区'}, {c: '330723', n: '武义县'}, {
        c: '330726',
        n: '浦江县'
      }, {c: '330727', n: '磐安县'}, {c: '330781', n: '兰溪市'}, {c: '330782', n: '义乌市'}, {
        c: '330783',
        n: '东阳市'
      }, {c: '330784', n: '永康市'}]
    }, {
      c: '330800',
      n: '衢州市',
      s: [{c: '330802', n: '柯城区'}, {c: '330803', n: '衢江区'}, {c: '330822', n: '常山县'}, {
        c: '330824',
        n: '开化县'
      }, {c: '330825', n: '龙游县'}, {c: '330881', n: '江山市'}]
    }, {
      c: '330900',
      n: '舟山市',
      s: [{c: '330902', n: '定海区'}, {c: '330903', n: '普陀区'}, {c: '330921', n: '岱山县'}, {
        c: '330922',
        n: '嵊泗县'
      }]
    }, {
      c: '331000',
      n: '台州市',
      s: [{c: '331002', n: '椒江区'}, {c: '331003', n: '黄岩区'}, {c: '331004', n: '路桥区'}, {
        c: '331021',
        n: '玉环县'
      }, {c: '331022', n: '三门县'}, {c: '331023', n: '天台县'}, {c: '331024', n: '仙居县'}, {
        c: '331081',
        n: '温岭市'
      }, {c: '331082', n: '临海市'}]
    }, {
      c: '331100',
      n: '丽水市',
      s: [{c: '331102', n: '莲都区'}, {c: '331121', n: '青田县'}, {c: '331122', n: '缙云县'}, {
        c: '331123',
        n: '遂昌县'
      }, {c: '331124', n: '松阳县'}, {c: '331125', n: '云和县'}, {c: '331126', n: '庆元县'}, {
        c: '331127',
        n: '景宁县'
      }, {c: '331181', n: '龙泉市'}]
    }]
  }];


// 保险表单
$(document).on('pageInit', '#page-city-picker', function(e, id, page) {

   var citypicker = $(page).find('#city-picker').cityPicker({
    code: true,
    onChangeComplete: function(picker) {
      var code = this.getCode(picker);
      var value = [];
      if(picker.value.length === 3) {
        value.push(picker.value[1]);
        value.push(picker.value[2]);
      } else {
        value = picker.value;
      }

      /*$('#city-picker-code').val(picker.params.getFormat(picker, code));*/
      $('#city-picker-value').val(value.join(' '));
    },
    rawCitiesData: customCitiesData
  });
  $(page).find('#city-picker-value').click(function(event){
    event.preventDefault();
    citypicker.trigger('click');
  });
});

